print("โปรแกรมคำนวณค่าผ่านทางมอเตอร์เวย์\n")
print ("\tรถยนต์ 4 ล้อ\tกด 1\n\tรถยนต์ 6 ล้อ\tกด 2\n\tรถยนต์มากกว่า 6 ล้อ \t กด 3")
car = input("เลือกประเภทรถยานพาหนะ : ")
car1 = ["ลาดกระบัง ไป บางบ่อ : 30", "ลาดกระบัง ไป บางประกง : 45", "ลาดกระบัง ไป พนัสนิคม : 55", "ลาดกระบัง ไป บ้านบึง : 60", "ลาดกระบัง ไป บางพระ : 80" ]
car2 = ["ลาดกระบัง ไป บางบ่อ : 30", "ลาดกระบัง ไป บางประกง : 45", "ลาดกระบัง ไป พนัสนิคม : 55", "ลาดกระบัง ไป บ้านบึง : 60", "ลาดกระบัง ไป บางพระ : 80" ]
car3 = ["ลาดกระบัง ไป บางบ่อ : 30", "ลาดกระบัง ไป บางประกง : 45", "ลาดกระบัง ไป พนัสนิคม : 55", "ลาดกระบัง ไป บ้านบึง : 60", "ลาดกระบัง ไป บางพระ : 80" ]
x = car1
print(x)